{"config":{"title":"MichaelArnel.com","subtitle":"Developer, Technolgy Enthusiast, Family Man","description":null,"author":"Michael Arnel","email":"michael.arnel@gmail.com","language":"English","url":"http://michaelarnel.com","root":"/","permalink":":year/:month/:day/:title/","tag_dir":"tags","archive_dir":"archives","category_dir":"categories","code_dir":"downloads/code","permalink_defaults":{},"source_dir":"source","public_dir":"public","new_post_name":":title.md","default_layout":"post","titlecase":false,"external_link":true,"filename_case":0,"render_drafts":false,"post_asset_folder":true,"relative_link":false,"highlight":{"enable":true,"line_number":true,"tab_replace":null},"default_category":"uncategorized","category_map":null,"tag_map":null,"archive":2,"category":2,"tag":2,"port":4000,"server_ip":"localhost","logger":false,"logger_format":null,"date_format":"MMM D YYYY","time_format":"H:mm:ss","per_page":10,"pagination_dir":"page","disqus_shortname":"michaelarnelcom","theme":"hueman","exclude_generator":null,"deploy":{"type":null},"auto_spacing":false,"max_open_file":100,"multi_thread":true,"markdown":{"gfm":true,"pedantic":false,"sanitize":false,"tables":true,"breaks":true,"smartLists":true,"smartypants":true},"stylus":{"compress":false}},"posts":[{"title":"Hello-World","date":"2015-02-22T02:11:04.000Z","comments":true,"content":"<p><img id=\"HelloWorldOldNew\" src=\"/2015/02/21/Hello-World/old-out-new-in.jpg\"> Out with the old in with the new! Or at least that’s how the old adage goes.  I’ve been sitting on this web domain for two or so years now, trying to figure out what to do with it.  The main reason I hadn’t done much up to this point has more to do with the costs to host a site given the web technologies I desired to play around with, rather than the lack of motivation.  Of course my idea of keeping costs down pretty much meant I didn’t really want to pay anything at all!</p>\n<p><br><br>I sat down a year ago and tried to come up with the various ways I could cheaply host my personal website and also take advantage of the cool new cutting edge frameworks and programming languages popping up everyday.  I started exploring the popular cloud services such as <em>AWS, Microsoft Azure, and Google App Services</em>.  All three offered comparable options and at relatively low costs given the services they are providing.  But I wasn’t ready to take on the added expense of hosting a personal website just yet.</p>\n<p><br><br>While exploring cheap hosting options I came across the concept of ‘Static Site Generators’.  This was nothing new had has been around for quite some time. A Static Site Generator or (SSG) is a tool that takes a collection of files in one format, usually Markdown (MD) and converts them to another, usually HTML.  The result is an extremely fast, consistent website that can be hosted by any webserver regardless of platform.  An additional benefit of a static generated site is that your website pages can easily be versioned using a source control tool since the entire site is nothing more than flat text files.</p>\n<p><br><br>After exploring everything I could learn about SSG’s I was convinced this was the route I wanted to take.  Of course there were some obvious downsides I had to live with.  Static Websites are exactly that… Static.  This meant I couldn’t use any server side programming languages, or serve any dynamic content. When I really sthought about what this meant, I realized the only thing I’d likely be using dynamic content for were user comments and I already knew there were options out there to get around this limitation.</p>\n<p><br><br>At this point I just needed a cheap way to host the site. <strong>Enter Github Pages!!!</strong>  As a developer I was already familiar with <a href=\"http://www.github.com\" target=\"_blank\" rel=\"external\">Github</a> as an online Source Control repository for hosting public and private projects.  One of the features github provides is Github pages.  Every User and/or Organization gets one website per account that’s served by <a href=\"http://www.github.com\" target=\"_blank\" rel=\"external\">Github</a> for no charge at all.  This is exactly what I was looking for!  All I needed now was to figure out how to set it all up.</p>\n<p><br><br>In my next article I’ll go into detail about the following:</p>\n<ul>\n<li>How I went about choosing an SSG</li>\n<li>Details about setting up and using the SSG</li>\n<li>Publishing the generated site content to github pages so your site is publicly available.<br><br></li>\n</ul>\n","source":"_posts/Hello-World.md","raw":"title: Hello-World\ndate: 2015-02-21 21:11:04\ntags:\ncategories: Misc\ncomments: true\n---\n<img id=\"HelloWorldOldNew\" src=\"/2015/02/21/Hello-World/old-out-new-in.jpg\"> Out with the old in with the new! Or at least that's how the old adage goes.  I've been sitting on this web domain for two or so years now, trying to figure out what to do with it.  The main reason I hadn't done much up to this point has more to do with the costs to host a site given the web technologies I desired to play around with, rather than the lack of motivation.  Of course my idea of keeping costs down pretty much meant I didn't really want to pay anything at all!\n<BR />\nI sat down a year ago and tried to come up with the various ways I could cheaply host my personal website and also take advantage of the cool new cutting edge frameworks and programming languages popping up everyday.  I started exploring the popular cloud services such as *AWS, Microsoft Azure, and Google App Services*.  All three offered comparable options and at relatively low costs given the services they are providing.  But I wasn't ready to take on the added expense of hosting a personal website just yet.\n<BR />\nWhile exploring cheap hosting options I came across the concept of 'Static Site Generators'.  This was nothing new had has been around for quite some time. A Static Site Generator or (SSG) is a tool that takes a collection of files in one format, usually Markdown (MD) and converts them to another, usually HTML.  The result is an extremely fast, consistent website that can be hosted by any webserver regardless of platform.  An additional benefit of a static generated site is that your website pages can easily be versioned using a source control tool since the entire site is nothing more than flat text files.\n<BR />\nAfter exploring everything I could learn about SSG's I was convinced this was the route I wanted to take.  Of course there were some obvious downsides I had to live with.  Static Websites are exactly that... Static.  This meant I couldn't use any server side programming languages, or serve any dynamic content. When I really sthought about what this meant, I realized the only thing I'd likely be using dynamic content for were user comments and I already knew there were options out there to get around this limitation.\n<BR />\nAt this point I just needed a cheap way to host the site. **Enter Github Pages!!!**  As a developer I was already familiar with <a href=\"http://www.github.com\">Github</a> as an online Source Control repository for hosting public and private projects.  One of the features github provides is Github pages.  Every User and/or Organization gets one website per account that's served by <a href=\"http://www.github.com\">Github</a> for no charge at all.  This is exactly what I was looking for!  All I needed now was to figure out how to set it all up.\n<BR />\nIn my next article I'll go into detail about the following:\n- How I went about choosing an SSG\n- Details about setting up and using the SSG\n- Publishing the generated site content to github pages so your site is publicly available.\n</br>\n","slug":"Hello-World","updated":"2015-02-21T19:16:19.000Z","excerpt":"","_id":"2o42higvwjrtscha","layout":"post","photos":[],"link":"","path":"2015/02/21/Hello-World/","permalink":"http://michaelarnel.com/2015/02/21/Hello-World/","full_source":"/Users/marnel/WebProjects/MichaelArnelcom/source/_posts/Hello-World.md","asset_dir":"/Users/marnel/WebProjects/MichaelArnelcom/source/_posts/Hello-World/","tags":[],"categories":[{"name":"Misc","_id":"eqzxoosd4c790dq4","posts":["2o42higvwjrtscha"],"slug":"Misc","path":"categories/Misc/","permalink":"http://michaelarnel.com/categories/Misc/","length":1}]}]}